//-------------------------------------------------------------------------------- ১. তোমাকে যদি বলি একটা স্ট্রিং টাইপের ভেরিয়েবল লিখো। একটা বুলিয়ান টাইপের ভেরিয়েবল লিখো বা একটা নাম্বার টাইপের ভেরিয়েবল লিখো। সেটা কি তুমি লিখতে পারবে? যদি পারো তাহলে ভিজুয়াল ষ্টুডিও কোড খুলে লিখে ফেলো।
//---------------------------------------------------------------------------------


var applePrice = 300;
console.log(typeof applePrice);

var nameOfMyGirl = ' Ariana Grande';
console.log(typeof nameOfMyGirl);

var applePrice = 300;
if (applePrice > 200) {

    console.log(true);
}
else {
    console.log(false);
}

// // -----------------------------------------------------------------------------
// // ২. তুমি কি জানো কখন let দিয়ে ভেরিয়েবল লিখতে হয়ে আর কখন const দিয়ে ভেরিয়েবল লিখতে হয়। যদি লিখতে পারো তাহলে লিখে ফেলো। এবং যেই যেটা দিয়ে ভেরিয়েবল লিখলে আবার সেটা চেইঞ্জ করা যায়। তাহলে যেটা দিয়ে ভেরিয়েবল ডিক্লেয়ার করলে চেইঞ্জ করা যায়। সেটার মান চেইঞ্জ করে নাও । অর্থাৎ জাস্ট দুইটা ভেরিয়েবল ডিক্লেয়ার করবে let এবং const দিয়ে। তারপর যেকোন একটার ভ্যালু চেইঞ্জ করবে। এই let এবং const মাথা গরম করে দিলে টেনশন নিয়ে না। সামনের মাইলস্টোন এর পরের মাইলস্টোন এ এইটা নিয়ে আরো ডিসকাস করা হবে।
// //------------------------------------------------------------------------------

// ----let can be updated but not re-declared.
let age = 15;
age = 16;
console.log(age);

// ----const cannot be updated or re-declared.
const mySubject = 'Economics';
mySubject = 'English';
console.log(mySubject); // error: Assignment to constant variable.

//---------------------------------------------------------------------------------
//  ৩. দুইটা ভেরিয়েবল এর মধ্যে যোগ, বিয়োগ, গুণ, ভাগ কিভাবে করতে হয় সেটা কি জানো। অর্থাৎ তুমি কি +, -, *, /, % এইগুলার ব্যবহার জানো। তাহলে নাম্বার টাইপের দুইটা ভেরিয়েবল লিখো তারপর তাদের যোগ করে সেটার মান আরেকটা ভেরিয়েবল এ রাখো। একইভাবে ওই দুইটা ভেরিয়েবল এর মধ্যে বিয়োগ, গুন, ভাগ এবং ভাগশেষ বের করো।
// //------------------------------------------------------------------------------

var onionPrice = 30;
var potatoPrice = 20;

additon, subtraction
var totalPrice = onionPrice + potatoPrice;
var priceDifference = onionPrice - potatoPrice;

console.log(priceDifference)
console.log(totalPrice);

multiplication

var onionPrice = 30;
var onionquantity = 3;
var totalCost = onionPrice * onionquantity;
console.log(totalCost);

division

var totalMoney = 500;
var totalPerson = 5;
var eachPersonGet = totalMoney / totalPerson;
console.log(eachPersonGet);

// --------------------------------------------------------------------------------
// ৪. তুমি কি দুইটা ভেরিয়েবল এরমধ্যে তুলনা করতে পারো। কম্পারিজন করতে পারো। যে দুইটা ভেরিয়েবল এর মধ্যে প্রথমটা সেকেন্ডটা এর চাইতে ছোট, বড়, অসমান, সমান , ছোট বা সমান, বড় বা সমান। এইগুলা চেক করতে পারো। অর্থাৎ <, >, ==, !=, <=, >= চিহ্নগুলা ব্যবহার করতে পারো। তাহলে দুইটা সংখ্যা টাইপের ভেরিয়েবল ডিক্লেয়ার করে তাদেরকে এই ছয়ভাবে তুলনা করে কোড লিখে ফেলো।
// --------------------------------------------------------------------------------


let num1 = 10;
let num2 = 20;

// Smaller Than, Greated Than
if (num1 < num2) {
    console.log(num1, 'is smaller than:', num2);
}
else {
    console.log(num2, 'is smaller than:', num1);
}

// Not Equal
if (num1 != num2) {
    console.log('not equal');
}
else {
    console.log('equal');
}

// Equal
if (num1 == num2) {
    console.log('equal');
}
else {
    console.log('not equal');
}

// Less Than Equal
if (num1 <= num2) {
    console.log('less than equal');
}
else {
    console.log('greated than');
}

// Greater Than Equal
if (num1 >= num2) {
    console.log('greater than equal');
}
else {
    console.log('less than');
}
// --------------------------------------------------------------------------------
// ৫. তোমার যদি দুইটা শর্ত পূরণ করতে বলে। এবং দুইটা শর্তের মধ্যে দুইটাই পূরণ করতে হবে। তাহলে তুমি কি সেটা চেক করতে পারবে? একইভাবে যদি বলে তুমি দুইটা শর্তের যেকোন একটা পূরণ করতে পারবে। অর্থাৎ তুমি && এবং || এর ব্যবহার করতে পারো কিনা। যদি পারো তাহলে নিজে নিজে এই রকমের কোড লিখে ফেলো।
// --------------------------------------------------------------------------------

var mysalary = 25000;
var isEducated = true;

if (mysalary > 20000 && isEducated == true) {
    console.log('he can marry her')
}
else {
    console.log('he cannot marry her')
}

// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

var mysalary = 25000;
var isEducated = true;

if (mysalary > 30000 || isEducated == true) {
    console.log('he can marry her')
}
else {
    console.log('he cannot marry her')
}


// --------------------------------------------------------------------------------
// ৬. তুমি কি একটা শর্ত পালন করলে একটা কিছু করবে। শর্ত পূরণ না করলে অন্য কিছু একটা করবে এমন কোড লিখতে পারবে। অর্থাৎ তুমি কি if-else এর কোড লিখতে পারবে। পারলে একটা কোড লিখে ফেলো
// --------------------------------------------------------------------------------

var isgraduated = true;

if (isgraduated == true) {
    console.log('I will continue my next plan')
}
else {
    console.log('I will not give up and wil try again')
}

// --------------------------------------------------------------------------------
// ৭. তোমাকে যদি বলে একটা while লুপ দিয়ে ৭ থেকে ১৯ পর্যন্ত যতগুলা বিজোড় সংখ্যা আছে সেগুলা দেখাতে। তুমি কি সেটা দেখাতে পারবে? পারলে সেই কোড লিখে ফেলো।
// --------------------------------------------------------------------------------

var number = 07;

while (number <= 19) {
    console.log(number);
    number = number + 2;
}

// --------------------------------------------------------------------------------
// ৮. তোমাকে যদি বলা হয় তুমি একটা array ডিক্লেয়ার করবে। এবং সেটার মধ্যে কয়টা উপাদান আছে সেটা বের করবে হবে। সেই array এর এর মধ্যে চতুর্থ পজিশন এর উপাদান চেইঞ্জ করতে হবে। array এর মধ্যে দুইটা উপাদান যোগ করতে হবে। এবং একটা উপাদান কে বের করে দিতে হবে। তুমি কি সেটা করতে পারবে।
// --------------------------------------------------------------------------------

var numbers = [23, 54, 34, 66, 67, 100, 20, 33];

console.log(numbers.length);

numbers[4] = 250;
console.log(numbers);

numbers.push(6, 7);
console.log(numbers);

numbers.pop();
console.log(numbers);

// --------------------------------------------------------------------------------
// ৯. তুমি কি একটা ফর লুপ দিয়ে কোন একটা array এর সবগুলা উপাদানকে দেখাতে পারবে। সেটা রেগুলার for লুপ হোক বা for of হোক। হলে সেই স্টাইলে একটা কোড লিখে ফেলো।
//---------------------------------------------------------------------------------

var numbers = [23, 54, 34, 66, 67, 100, 20, 33];

for (var i = 0; i <= 7; i++) {
    console.log();
}
var number = numbers[i];
console.log(numbers);


// --------------------------------------------------------------------------------
// ১০. তোমাকে যদি বলা হয় একটা array এর মধ্যে ৮০ এর চাইতে বড় সংখ্যা থাকলে সেগুলাকে console log করে দেখাতে সেটা কি তুমি পারবে? তাহলে তুমি সেই কোড করে ফেলো
// --------------------------------------------------------------------------------

let arr = [20, 34, 10, 80, 85, 90, 100, 150, 200];

for (let i = 0; i < arr.length; i++) {
    if (arr[i] > 80) {
        console.log(arr[i]);
    }
}


// --------------------------------------------------------------------------------
// ১১. তিনটা সংখ্যার গুনফল বের করে ফাইনাল রেজাল্ট আউটপুট হিসেবে রিটার্ন করতে হবে। তুমি কি সেই কোড লিখতে পারবে। যদি পারো তাহলে সেই কোড লিখে ফেলো।
// --------------------------------------------------------------------------------

function multiplication(num1, num2, num3) {
    let total = num1 * num2 * num3;
    return total;
}
var result = multiplication(3, 4, 2);
console.log(result);

// --------------------------------------------------------------------------------
// ১২. একটা অবজেক্ট ডিক্লেয়ার করবে। সেটাতে তিনটা প্রপার্টি থাকবে। এবং কোন একটা প্রোপার্টি এর মান চেইঞ্জ করবা।
// --------------------------------------------------------------------------------

var myMobile = {

    brand: 'samsung',
    price: 39000,
    color: 'blue'
}
console.log(myMobile);
myMobile.price = 31000;
console.log(myMobile);